---
kind: other
id: Properties.T:Autodesk.Revit.DB.ContourSettingItem
source: html/b8217140-9e3e-e377-7ff0-b8273333178e.htm
---
# ContourSettingItem Properties

Specifies whether the .NET object represents a valid Revit entity.